In [3]:
# Importacion de la libreria numpy
import numpy 

#Creacion de un arreglo
arreglo = numpy.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [5]:
# Importacion de la libreria numpy
import numpy as np

#Creacion de un arreglo
arreglo = np.array([[1,2,3],[4,5,6],[7,8,9]])
arreglo

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [7]:
import pandas as pd

#Creacion de un DataFrame
df = pd.DataFrame(arreglo)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
#Modificacion de las columnas del DataFrame
df = pd.DataFrame(data = arreglo, index = ['A','B','C'], columns = ['D','E','F'])
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [13]:
# Seccion superior (ENCABEZADO)
# Extrae dos valores del dataframe
df.head(2)

   D  E  F
A  1  2  3
B  4  5  6

In [15]:
# Informacion de cada columna
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   D       3 non-null      int64
 1   E       3 non-null      int64
 2   F       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [19]:
# Dimension del dataframe
df.shape

(3, 3)

In [21]:
# Calculo de estadisticas generales de la tabla
df.describe()

         D    E    F
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [23]:
# Nombres de las columnas
df.columns

Index(['D', 'E', 'F'], dtype='object')

In [25]:
# Nombres de los renglones
df.index

Index(['A', 'B', 'C'], dtype='object')

In [27]:
#Adicion de un nuevo renglon al Dataframe
df.loc['G'] = [11,12,13]
df

    D   E   F
A   1   2   3
B   4   5   6
C   7   8   9
G  11  12  13

In [29]:
# Adicion a una nueva columna al DataFrame
df['H'] = [17,16,15,14]
df

    D   E   F   H
A   1   2   3  17
B   4   5   6  16
C   7   8   9  15
G  11  12  13  14

In [35]:
# Extraccion de columnas del dataframe
df2 = df[['E','H']]
df2

    E   H
A   2  17
B   5  16
C   8  15
G  12  14

In [37]:
# Extraccion de renglones en un dataframe
df3 = df.iloc[0:2] #Extrae los primeros dos renglones
df3

   D  E  F   H
A  1  2  3  17
B  4  5  6  16

In [55]:
# Cambio de nombre en TODAS las columnas
df.columns = ["Columna1","Columna2","Columna3","Columna4"]
df

        Columna1  Columna2  Columna3  Columna4
Dato 1         1         2         3        17
B              4         5         6        16
C              7         8         9        15
G             11        12        13        14

In [57]:
# Cambio de nombre en ALGUNAS columnas
df.rename(columns = {'Columna1':"Column1", 'Columna2':"Column2", 'Columna3':"Column3"}, inplace = True)
df

        Column1  Column2  Column3  Columna4
Dato 1        1        2        3        17
B             4        5        6        16
C             7        8        9        15
G            11       12       13        14

In [63]:
# Cambio de los nombres en los renglones
df.rename(index = {"A":"Dato 1", "B":"Dato 2"}, inplace = True)
df

        Column1  Column2  Column3  Columna4
Dato 1        1        2        3        17
Dato 2        4        5        6        16
C             7        8        9        15
G            11       12       13        14

In [65]:
# Ordenamiento de Dataframes
df4 = df.sort_values("Columna4", ascending = True)
df4

        Column1  Column2  Column3  Columna4
G            11       12       13        14
C             7        8        9        15
Dato 2        4        5        6        16
Dato 1        1        2        3        17

In [67]:
# Verificacion de condiciones en DataFrames
df["Column2"] > 5

Dato 1    False
Dato 2    False
C          True
G          True
Name: Column2, dtype: bool

In [69]:
df[df["Column2"] > 5]

   Column1  Column2  Column3  Columna4
C        7        8        9        15
G       11       12       13        14

In [73]:
condicion1 = df["Column1"] > 1
condicion2 = df["Column2"] < 12
df[condicion1 & condicion2]

        Column1  Column2  Column3  Columna4
Dato 2        4        5        6        16
C             7        8        9        15

In [105]:
# Creacion de un Dataframe
# Ejercicio: Mediante el uso de las librerias NumPy y Pandas desarrole un codigo en Python que sea capaz de generar
#            el siguiente Dataframe

import numpy as np
import pandas as pd

array = np.array([["Bella","Labrador","Cafe",56,24,"2013-07-01"],
                  ["Charlie","Poodle","Negro",43,24,"2016-09-16"],
                  ["Lucy","Chow Chow","Cafe",46,24,"2014-08-25"],
                  ["Cooper","Schnauzer","Gris",49,17,"2016-09-16"],
                  ["Bernie","San Bernardo","Blanco",77,74,"2016-09-16"],])
df = pd.DataFrame(data = array, columns = ["Nombre","Raza","Color","Altura_cm","Peso_kg","Fecha_Nac"])
df

    Nombre          Raza   Color Altura_cm Peso_kg   Fecha_Nac
0    Bella      Labrador    Cafe        56      24  2013-07-01
1  Charlie        Poodle   Negro        43      24  2016-09-16
2     Lucy     Chow Chow    Cafe        46      24  2014-08-25
3   Cooper     Schnauzer    Gris        49      17  2016-09-16
4   Bernie  San Bernardo  Blanco        77      74  2016-09-16

In [107]:
#Extraer quellos registros de los perros cuya fecha de nacimiento es anterior al 1 de Enero del 2015
df2 = df[df["Fecha_Nac"] <= "2015-01-01"]
df2

  Nombre       Raza Color Altura_cm Peso_kg   Fecha_Nac
0  Bella   Labrador  Cafe        56      24  2013-07-01
2   Lucy  Chow Chow  Cafe        46      24  2014-08-25

In [111]:
# Extraer aquellos registros de los perros cuya estatura es mayor a 50 cms
df["Altura_cm"] = df["Altura_cm"].astype(int)
df3 = df[df["Altura_cm"] >= 50]
df3

   Nombre          Raza   Color  Altura_cm Peso_kg   Fecha_Nac
0   Bella      Labrador    Cafe         56      24  2013-07-01
4  Bernie  San Bernardo  Blanco         77      74  2016-09-16

In [113]:
# Agregar una nueva columna a este Dataframe que calcule el indice de masa muscular (IMM) para cada perro
# El cual esta dado por: IMM = (peso en Kgs) / (Altura en Metros) ** 2
df["Peso_kg"] = df["Peso_kg"].astype(int)
df["IMM"] = (df["Altura_cm"] / df["Peso_kg"]) ** 2
df

    Nombre          Raza   Color  Altura_cm  Peso_kg   Fecha_Nac       IMM
0    Bella      Labrador    Cafe         56       24  2013-07-01  5.444444
1  Charlie        Poodle   Negro         43       24  2016-09-16  3.210069
2     Lucy     Chow Chow    Cafe         46       24  2014-08-25  3.673611
3   Cooper     Schnauzer    Gris         49       17  2016-09-16  8.307958
4   Bernie  San Bernardo  Blanco         77       74  2016-09-16  1.082725